propeller/propeller-stampede2/system/surfaceFeatureExtractDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeatureExtractDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//innerCylinder.obj
//{
//    #include "surfaceFeatureExtractDictDefaults"
//}


innerCylinderSmall.obj
{
    #include "surfaceFeatureExtractDictDefaults"
}


outerCylinder.obj
{
    #include "surfaceFeatureExtractDictDefaults"
}


shaft.stl
{
    #include "surfaceFeatureExtractDictDefaults"
}


UM23prop.stl             
{
    #include "surfaceFeatureExtractDictDefaults"
}


// ************************************************************************* //
